# Heroes of Pymolii

Observations
- A remarkably higher number of men play the game than women
- There were some items with differing Item IDs and prices, which may have altered some calculations
- 75% of players are over the age of 20

In [1]:
#import dependencies
import pandas as pd
import json
from pandas.io.json import json_normalize
from sklearn import preprocessing

In [2]:
#read json file
data = pd.read_json("purchase_data.json")
#data["Price"] = data["Price"].map("${:.2f}".format)
data.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [3]:
#calculate total players
Total_Players = data["SN"].nunique()
Total_Players

573

In [4]:
#Calculate number of items
Unique_Items = data["Item Name"].nunique()
Unique_Items

179

In [5]:
#Calculate average price
Average_Price = data["Price"].mean()
Average_Price

2.931192307692303

In [6]:
#Calculate total number of purchases
Total_Purch = data["SN"].count()
Total_Purch

780

In [7]:
#Calculate total revenue
Total_Rev = data["Price"].sum()
Total_Rev

2286.33

In [8]:
#Create overall summary table
summary_table1 = pd.DataFrame({"Total Players":[Total_Players],
                             "Number of Unique Items":[Unique_Items],
                             "Average Purchase Price":[Average_Price],
                             "Total Number of Purchases":[Total_Purch],
                             "Total Revenue":[Total_Rev]})

In [9]:
#Format summary table $$ columns
summary_table1["Average Purchase Price"] = summary_table1["Average Purchase Price"].map("${:.2f}".format)
summary_table1["Total Revenue"] = summary_table1["Total Revenue"].map("${:.2f}".format)

summary_table1

,Average Purchase Price,Number of Unique Items,Total Number of Purchases,Total Players,Total Revenue
0,$2.93,179,780,573,$2286.33

In [10]:
#rearrange columns
summary_table1 = summary_table1[["Total Players", "Total Revenue", "Total Number of Purchases", 
                                "Number of Unique Items", "Average Purchase Price"]]
summary_table1

,Total Players,Total Revenue,Total Number of Purchases,Number of Unique Items,Average Purchase Price
0,573,$2286.33,780,179,$2.93

In [11]:
#Calculate total of each gender
GenSum = data.groupby(["Gender"])["SN"].nunique()
GenSum

Gender
Female                   100
Male                     465
Other / Non-Disclosed      8
Name: SN, dtype: int64

In [12]:
#Calculate gender percentages
PercentGen = (GenSum/Total_Players)*100
PercentGen

Gender
Female                   17.452007
Male                     81.151832
Other / Non-Disclosed     1.396161
Name: SN, dtype: float64

In [13]:
#Create gender summary table
Gender_summary = pd.DataFrame({"Percent of Total" :
                  PercentGen, "Total Number of Players" :
                   GenSum})

Gender_summary

                       Percent of Total  Total Number of Players
Gender
Female                        17.452007                      100
Male                          81.151832                      465
Other / Non-Disclosed          1.396161                        8

In [14]:
#Calculate gender purchase data
Total_GenPurch = data.groupby(["Gender"])["Item ID"].count()
Total_GenPurch

Gender
Female                   136
Male                     633
Other / Non-Disclosed     11
Name: Item ID, dtype: int64

In [15]:
Avg_GenPurch = data.groupby(["Gender"])["Price"].mean()
Avg_GenPurch

Gender
Female                   2.815515
Male                     2.950521
Other / Non-Disclosed    3.249091
Name: Price, dtype: float64

In [71]:
Total_GenRev = data.groupby(["Gender"])[["Price"]].sum()
Total_GenRev

                         Price
Gender
Female                  382.91
Male                   1867.68
Other / Non-Disclosed    35.74

In [17]:
#Create gender purchase summary table
GenPurch_Summary = pd.DataFrame({"Total Purchase Count" : Total_GenPurch, "Average Purchase Price" : Avg_GenPurch, 
                            "Total Purchase Value" : Total_GenRev})
GenPurch_Summary

,Average Purchase Price,Total Purchase Count,Total Purchase Value
Gender,,,
Female,2.815515,136,382.91
Male,2.950521,633,1867.68
Other / Non-Disclosed,3.249091,11,35.74

In [18]:
#Normalize Data
# Create x, where x the 'scores' column's values as floats
x = GenPurch_Summary[['Total Purchase Value']].values.astype(float)

In [19]:
# Create a minimum and maximum processor object
min_max_scaler = preprocessing.MinMaxScaler()

# Create an object to transform the data to fit minmax processor
x_scaled = min_max_scaler.fit_transform(x)

# Run the normalizer on the dataframe
Gen_normalized = (x_scaled)

In [20]:
#Add Normalization column to table
GenPurch_Summary["Normalized Totals"] = Gen_normalized
GenPurch_Summary

,Average Purchase Price,Total Purchase Count,Total Purchase Value,Normalized Totals
Gender,,,,
Female,2.815515,136,382.91,0.189509
Male,2.950521,633,1867.68,1.000000
Other / Non-Disclosed,3.249091,11,35.74,0.000000

In [21]:
#create age bins
max_age = data["Age"].max()
# Create the bins in which Data will be held
bins = [0, 9, 14, 19, max_age]

# Create the names for the four bins
group_names = ['Under 10', '10-14', '15-19', '20+']
pd.cut(data["Age"], bins, labels=group_names)

0        20+
1        20+
2        20+
3        20+
4        20+
5        20+
6        20+
7        20+
8        20+
9        20+
10       20+
11       20+
12       20+
13       20+
14       20+
15       20+
16       20+
17       20+
18       20+
19       20+
20       20+
21     15-19
22     10-14
23     15-19
24     10-14
25       20+
26       20+
27       20+
28     15-19
29     15-19
       ...
750      20+
751      20+
752    15-19
753      20+
754      20+
755      20+
756      20+
757      20+
758      20+
759    15-19
760      20+
761      20+
762      20+
763      20+
764      20+
765    15-19
766      20+
767      20+
768      20+
769      20+
770      20+
771      20+
772    15-19
773      20+
774      20+
775      20+
776    10-14
777      20+
778      20+
779      20+
Name: Age, Length: 780, dtype: category
Categories (4, object): [Under 10 < 10-14 < 15-19 < 20+]

In [22]:
#Add bins to dataframe
data["Age Summary"] = pd.cut(data["Age"], bins, labels=group_names)
data.head()

,Age,Gender,Item ID,Item Name,Price,SN,Age Summary
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34,20+
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46,20+
2,34,Male,174,Primitive Blade,2.46,Assastnya25,20+
3,21,Male,92,Final Critic,1.36,Pheusrical25,20+
4,23,Male,63,Stormfury Mace,1.27,Aela59,20+

In [23]:
#Calculate age demographic data
AgeSum = data.groupby(["Age Summary"])["SN"].nunique()
AgeSum

Age Summary
Under 10     19
10-14        23
15-19       100
20+         431
Name: SN, dtype: int64

In [24]:
Percent_Age = (AgeSum / Total_Players)*100
Percent_Age

Age Summary
Under 10     3.315881
10-14        4.013962
15-19       17.452007
20+         75.218150
Name: SN, dtype: float64

In [25]:
#Create Age Demographic data summary
Age_Data = pd.DataFrame({"Percent of Total" :
                  Percent_Age, "Total Number of Players" :
                   AgeSum})
Age_Data

             Percent of Total  Total Number of Players
Age Summary
Under 10             3.315881                       19
10-14                4.013962                       23
15-19               17.452007                      100
20+                 75.218150                      431

In [26]:
#Calculate age demographic purchase data
Purchase_Count = data.groupby(['Age Summary'])['Item ID'].count()
Purchase_Count

Age Summary
Under 10     28
10-14        35
15-19       133
20+         584
Name: Item ID, dtype: int64

In [27]:
Total_Purch_Age = data.groupby(['Age Summary'])["Price"].sum()
Total_Purch_Age

Age Summary
Under 10      83.46
10-14         96.95
15-19        386.42
20+         1719.50
Name: Price, dtype: float64

In [28]:
Avg_Purch_Age = data.groupby(['Age Summary'])['Price'].mean()
Avg_Purch_Age

Age Summary
Under 10    2.980714
10-14       2.770000
15-19       2.905414
20+         2.944349
Name: Price, dtype: float64

In [29]:
#Create age purchase summary table
Age_Summary = pd.DataFrame({"Total Purchase Count" : Purchase_Count, "Average Purchase Price" : Avg_Purch_Age, 
                            "Total Purchase Value" : Total_Purch_Age})
Age_Summary

,Average Purchase Price,Total Purchase Count,Total Purchase Value
Age Summary,,,
Under 10,2.980714,28,83.46
10-14,2.770000,35,96.95
15-19,2.905414,133,386.42
20+,2.944349,584,1719.50

In [30]:
#Normalize data
# Create x, where x stores the 'Total Purchase Value' column's values as floats
y = Age_Summary[['Total Purchase Value']].values.astype(float)

In [31]:
# Create a minimum and maximum processor object
min_max_scaler = preprocessing.MinMaxScaler()

# Create an object to transform the data to fit minmax processor
y_scaled = min_max_scaler.fit_transform(y)

# Run the normalizer on the dataframe
Age_normalized = (y_scaled)

In [32]:
#add normalized column to table
Age_Summary["Normalized Totals"] = Age_normalized
Age_Summary

,Average Purchase Price,Total Purchase Count,Total Purchase Value,Normalized Totals
Age Summary,,,,
Under 10,2.980714,28,83.46,0.000000
10-14,2.770000,35,96.95,0.008246
15-19,2.905414,133,386.42,0.185179
20+,2.944349,584,1719.50,1.000000

In [33]:
#calculate top spender data
top_spend = data.groupby(["SN"])["Price"].sum()
Avg_top5 = data.groupby(["SN"])["Price"].mean()
total_top5 = data.groupby(["SN"])["Item ID"].count()

top_5 = pd.DataFrame({"Total Items Purchased" : total_top5, 
                      "Average Purchase Price" : Avg_top5, 
                      "Total Spent" : top_spend})
top_5data = top_5.nlargest(columns="Total Spent", n=5)
top_5data

             Average Purchase Price  Total Items Purchased  Total Spent
SN
Undirrala66                3.412000                      5        17.06
Saedue76                   3.390000                      4        13.56
Mindimnya67                3.185000                      4        12.74
Haellysu29                 4.243333                      3        12.73
Eoda93                     3.860000                      3        11.58

In [70]:
#calculate popular item data
purch_counts = data.groupby(["Item ID", "Item Name", "Price"])["Item ID"].count()
purch_value = data.groupby(["Item ID", "Item Name", "Price"])["Price"].sum()

top_pop = pd.DataFrame({"Purchase Count" : purch_counts, 
                        "Total Purchase Value" : purch_value})
top_pop_data = top_pop.nlargest(columns="Purchase Count", n=5)
top_pop_data

,,,Purchase Count,Total Purchase Value
Item ID,Item Name,Price,,
39,"Betrayal, Whisper of Grieving Widows",2.35,11,25.85
84,Arcane Gem,2.23,11,24.53
13,Serenity,1.49,9,13.41
31,Trickster,2.07,9,18.63
34,Retribution Axe,4.14,9,37.26

In [72]:
#Calculate top revenue data
prof_counts = data.groupby(["Item ID", "Item Name", "Price"])["Item ID"].count()
prof_value = data.groupby(["Item ID", "Item Name", "Price"])["Price"].sum()

top_prof = pd.DataFrame({"Purchase Count" : prof_counts, 
                        "Total Purchase Value" : prof_value})
top_prof_data = top_prof.nlargest(columns="Total Purchase Value", n=5)
top_prof_data

                                          Purchase Count  Total Purchase Value
Item ID Item Name                  Price
34      Retribution Axe            4.14                9                 37.26
115     Spectral Diamond Doomblade 4.25                7                 29.75
32      Orenmir                    4.95                6                 29.70
103     Singed Scalpel             4.87                6                 29.22
107     Splitter, Foe Of Subtlety  3.61                8                 28.88